# WireDiameterTooLarge Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricFailures..::..WireDiameterTooLarge Property
BuiltInFailures..::..FabricFailures Class See Also
---
Fabric Wire Diameter is too large.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WireDiameterTooLarge { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WireDiameterTooLarge As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WireDiameterTooLarge {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FabricFailures Class
Autodesk.Revit.DB Namespace